import React from "react";
import "./MyFuture.css";

const MyFuture = () => {
  return (
    <div className="my-future">
      <h1>Мій розвиток 💻🚀</h1>

      <p>
        Я, <strong>Аліса Даєва</strong>, студентка спеціальності
        <em> «Комп’ютерні науки»</em> і бачу своє майбутнє у сфері front-end
        розробки та створення сучасних веб-додатків.
      </p>

      <h2>Мої 3 кроки в майбутнє:</h2>
      <ol>
        <li>🌱 Завершити навчання у НУБіП з високими результатами.</li>
        <li>🛠 Пройти стажування або отримати першу роботу в IT-компанії.</li>
        <li>🚀 Розвивати свої скіли у React та Node.js  </li>
      </ol>

      <h2>Професія мрії 💼</h2>
      <p>
        Мрію стати креативним front-end розробником у дружній компанії, де можна
        реалізовувати свої ідеї, працювати в команді та створювати продукти, якими
        користуються тисячі людей.
      </p>

      <blockquote>
        “Успіх — це не випадковість. Це важка праця, наполегливість, навчання,
        жертви та, перш за все, любов до того, що ви робите.” — Пеле
      </blockquote>

      <h2>Мій план ✨</h2>
      <ul className="timeline">
        <li>
          <strong>2025</strong> – React, адаптивна верстка, pet-проєкти
        </li>
        <li>
          <strong>2026</strong> – стажування або перша робота
        </li>
        <li>
          <strong>2027+</strong> – розвиток як розробника, власні проєкти
        </li>
      </ul>
    </div>
  );
};

export default MyFuture;
